Autodesk.Revit.DB.StairsEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts an stairs edit mode for an existing Stairs element
Remarks:
User will need to start a transaction to actually make changes to the stairs element.
StairsEditScope can only be started when there is no transaction active
Thus it does not work for commands running in automatic transaction mode.
stairsId:
The stairs element to be edited.
Returns:
ElementId of the editing stairs. It should be the same as the input stairsId
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a Stair's id.
-or-
Stairs is not permitted to edit at this moment for the following reason:
The Stairs is in an ElementGroup and it is not in Edit Group Mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
StairsEditScope is not permitted to start at this moment for one of the following reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is a stairs edit mode active in the document.
Since:
2013

Autodesk.Revit.DB.StairsEditScope.Start(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new empty stairs element with a default stairs type in the specified levels
and then starts stairs edit mode and editing the new stairs.
Remarks:
A new stairs will be created after this operation.
User will need to start a transaction to actually make changes to the stairs element.
StairsEditScope can only be started when there is no transaction active
Thus it does not work for commands running in automatic transaction mode.
baseLevelId:
The base level on which the stairs is to be placed.
topLevelId:
The top level where the stairs is to reach.
Returns:
ElementId of the new stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a Level's id.
-or-
Top level should be higher than base level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
StairsEditScope is not permitted to start at this moment for one of the following reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is a stairs edit mode active in the document.
Since:
2013

Autodesk.Revit.DB.StairsEditScope.IsPermitted
Tells if the StairsEditScope is permitted to start.
Remarks:
The StairsEditScope is not permitted to start if any other edit mode is active in the same document.
Since:
2013

Autodesk.Revit.DB.StairsEditScope.#ctor(Autodesk.Revit.DB.Document,System.String)
Instantiates a StairsEditScope object.
document:
The document for which this StairsEditScope is going to be used.
transactionName:
The name that will appear in the Undo menu in Revit after the StairsEditScope is successfully committed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a primary document, it is a linked document.
-or-
document is not a project document.
-or-
transactionName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.StairsEditScope
StairsEditScope allows user to maintain a stairs-editing session.
Remarks:
Start/end of a StairsEditScope will start/end a transaction group. After a StairsEditScope is started, user can start transactions and edit the stairs.
Individual transactions the user creates inside StairsEditScope will not appear in the undo menu.
All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into StairsEditScope constructor.
Since:
2013